Revit 2024 API
BuiltInFailures.PerformanceFailures.InteriorCategoriesEnabledInLargeView Property
 Interior categories are enabled in a large view. Even though these objects may be obscured and invisible, they still have negative impact on performance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InteriorCategoriesEnabledInLargeView { get; }
Visual Basic
Public Shared ReadOnly Property InteriorCategoriesEnabledInLargeView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InteriorCategoriesEnabledInLargeView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace